airbbb_api/app/controllers/api/v1/airlines_controller.rb

            def index
               airlines = Airline.all
---
SELECT "airlines".* FROM "airlines"

            def show
                airline = Airline.find_by(slug: params[:slug])
---
SELECT "airlines".* FROM "airlines" WHERE "airlines"."slug" = $1 LIMIT $2  [["slug", "test-airline"], ["LIMIT", 1]]

            def create
                airline = Airline.new(airline_params)

                if airline.save
---
INSERT INTO "airlines" ("name", "image_url", "slug", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "test airline"], ["image_url", "image.url"], ["slug", "test-airline"], ["created_at", "2020-07-14 23:03:17.556918"], ["updated_at", "2020-07-14 23:03:17.556918"]]

            def update
                airline = Airline.find_by(slug: params[:slug])

                if airline.update(airline_params)
---
SELECT "airlines".* FROM "airlines" WHERE "airlines"."slug" = $1 LIMIT $2  [["slug", "test-airline"], ["LIMIT", 1]]
UPDATE "airlines" SET "name" = $1, "updated_at" = $2 WHERE "airlines"."id" = $3  [["name", "other test airline"], ["updated_at", "2020-07-14 23:10:36.694494"], ["id", 7]]

            def destroy
                airline = Airline.find_by(slug: params[:slug])

                if airline.destroy
---
SELECT "airlines".* FROM "airlines" WHERE "airlines"."slug" = $1 LIMIT $2  [["slug", "test-airline"], ["LIMIT", 1]]
DELETE FROM "airlines" WHERE "airlines"."id" = $1  [["id", 7]]