airbbb_api/app/controllers/api/v1/auth_controller.rb

        def create
            user = User.find_by(email: params[:user][:email]).try(:authenticate, params[:user][:password])
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "test@test.com"], ["LIMIT", 1]]