airbbb_api/app/controllers/api/v1/registrations_controller.rb

        def create
          user = User.new(
            email: params[:user][:email],
            password: params[:user][:password],
            password_confirmation: params[:user][:password]
          )

          if user.save
---
INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"