airbbb_api/app/controllers/api/v1/reviews_controller.rb

INSERT INTO "reviews" ("title", "description", "score", "airline_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Best airline ever"], ["description", "nobody in my row"], ["score", 5], ["airline_id", 1], ["created_at", "2020-07-15 02:53:18.829525"], ["updated_at", "2020-07-15 02:53:18.829525"]]
---
            def create
                review = airline.reviews.new(review_params)

                if review.save

SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "reviews" WHERE "reviews"."id" = $1  [["id", 3]]
---
            def destroy
                review = Review.find(params[:id])

                if review.destroy

SELECT "airlines".* FROM "airlines" WHERE "airlines"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
            def airline
                @airline ||= Airline.find(params[:airline_id])